1) C:\xampp\htdocs\github\php-nf\src\Classes\Configuration\ConfigurationLoader.php:62    [M] UnwrapUcWords

--- Original
+++ New
@@ @@
     }
     private function convertHyphenatedToCamelCase(string $hyphenatedString) : string
     {
-        $uppercasedWordsString = ucwords($hyphenatedString, '-');
+        $uppercasedWordsString = $hyphenatedString;
         $camelCaseString = str_replace('-', '', $uppercasedWordsString);
         return $camelCaseString;
     }

2) C:\xampp\htdocs\github\php-nf\src\Classes\PhpClass\PhpClass.php:58    [M] Throw_

--- Original
+++ New
@@ @@
         $relativePath = str_replace('/', '\\', $this->relativePath);
         $expectedNamespace = "{$this->baseNamespace}\\{$relativePath}";
         if (!$this->namespaceBelongsToBaseNamespace()) {
-            throw new NamespaceIsNotValidException($this->absolutePath, $this->namespace, NamespaceIsNotValidException::NAMESPACE_DOES_NOT_BELONG_TO_BASE_NAMESPACE);
+            new NamespaceIsNotValidException($this->absolutePath, $this->namespace, NamespaceIsNotValidException::NAMESPACE_DOES_NOT_BELONG_TO_BASE_NAMESPACE);
         }
         $expectedNamespace = trim($expectedNamespace, '\\');
         if ($this->namespace !== $expectedNamespace) {

3) C:\xampp\htdocs\github\php-nf\src\Classes\PhpClass\PhpClass.php:61    [M] UnwrapTrim

--- Original
+++ New
@@ @@
         if (!$this->namespaceBelongsToBaseNamespace()) {
             throw new NamespaceIsNotValidException($this->absolutePath, $this->namespace, NamespaceIsNotValidException::NAMESPACE_DOES_NOT_BELONG_TO_BASE_NAMESPACE);
         }
-        $expectedNamespace = trim($expectedNamespace, '\\');
+        $expectedNamespace = $expectedNamespace;
         if ($this->namespace !== $expectedNamespace) {
             throw new NamespaceIsNotValidException($this->absolutePath, $this->namespace, NamespaceIsNotValidException::NAMESPACE_DOES_NOT_MATCH_PATH);
         }

4) C:\xampp\htdocs\github\php-nf\src\Classes\PhpClass\PhpClassLoader.php:59    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     private function findPhpFilesInPath(string $path) : Finder
     {
-        $this->finder->in($path);
+        
         $this->finder->files();
         return $this->finder;
     }

5) C:\xampp\htdocs\github\php-nf\src\Classes\PhpClass\PhpClassLoader.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function findPhpFilesInPath(string $path) : Finder
     {
         $this->finder->in($path);
-        $this->finder->files();
+        
         return $this->finder;
     }
     private function extractNamespaceFromClassContent(string $classContent) : string

Timed Out mutants:
==================
